; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p8---int100n150-m25---int100c200---s84---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 - fuellevel
)

(:init
(sum level0 level4 level4)
(sum level0 level17 level17)
(sum level0 level25 level25)
(sum level1 level4 level5)
(sum level1 level17 level18)
(sum level1 level25 level26)
(sum level2 level4 level6)
(sum level2 level17 level19)
(sum level2 level25 level27)
(sum level3 level4 level7)
(sum level3 level17 level20)
(sum level3 level25 level28)
(sum level4 level4 level8)
(sum level4 level17 level21)
(sum level4 level25 level29)
(sum level5 level4 level9)
(sum level5 level17 level22)
(sum level5 level25 level30)
(sum level6 level4 level10)
(sum level6 level17 level23)
(sum level6 level25 level31)
(sum level7 level4 level11)
(sum level7 level17 level24)
(sum level7 level25 level32)
(sum level8 level4 level12)
(sum level8 level17 level25)
(sum level8 level25 level33)
(sum level9 level4 level13)
(sum level9 level17 level26)
(sum level9 level25 level34)
(sum level10 level4 level14)
(sum level10 level17 level27)
(sum level10 level25 level35)
(sum level11 level4 level15)
(sum level11 level17 level28)
(sum level11 level25 level36)
(sum level12 level4 level16)
(sum level12 level17 level29)
(sum level12 level25 level37)
(sum level13 level4 level17)
(sum level13 level17 level30)
(sum level13 level25 level38)
(sum level14 level4 level18)
(sum level14 level17 level31)
(sum level14 level25 level39)
(sum level15 level4 level19)
(sum level15 level17 level32)
(sum level15 level25 level40)
(sum level16 level4 level20)
(sum level16 level17 level33)
(sum level16 level25 level41)
(sum level17 level4 level21)
(sum level17 level17 level34)
(sum level17 level25 level42)
(sum level18 level4 level22)
(sum level18 level17 level35)
(sum level18 level25 level43)
(sum level19 level4 level23)
(sum level19 level17 level36)
(sum level19 level25 level44)
(sum level20 level4 level24)
(sum level20 level17 level37)
(sum level20 level25 level45)
(sum level21 level4 level25)
(sum level21 level17 level38)
(sum level21 level25 level46)
(sum level22 level4 level26)
(sum level22 level17 level39)
(sum level22 level25 level47)
(sum level23 level4 level27)
(sum level23 level17 level40)
(sum level23 level25 level48)
(sum level24 level4 level28)
(sum level24 level17 level41)
(sum level24 level25 level49)
(sum level25 level4 level29)
(sum level25 level17 level42)
(sum level25 level25 level50)
(sum level26 level4 level30)
(sum level26 level17 level43)
(sum level26 level25 level51)
(sum level27 level4 level31)
(sum level27 level17 level44)
(sum level27 level25 level52)
(sum level28 level4 level32)
(sum level28 level17 level45)
(sum level28 level25 level53)
(sum level29 level4 level33)
(sum level29 level17 level46)
(sum level29 level25 level54)
(sum level30 level4 level34)
(sum level30 level17 level47)
(sum level30 level25 level55)
(sum level31 level4 level35)
(sum level31 level17 level48)
(sum level31 level25 level56)
(sum level32 level4 level36)
(sum level32 level17 level49)
(sum level32 level25 level57)
(sum level33 level4 level37)
(sum level33 level17 level50)
(sum level33 level25 level58)
(sum level34 level4 level38)
(sum level34 level17 level51)
(sum level34 level25 level59)
(sum level35 level4 level39)
(sum level35 level17 level52)
(sum level35 level25 level60)
(sum level36 level4 level40)
(sum level36 level17 level53)
(sum level36 level25 level61)
(sum level37 level4 level41)
(sum level37 level17 level54)
(sum level37 level25 level62)
(sum level38 level4 level42)
(sum level38 level17 level55)
(sum level38 level25 level63)
(sum level39 level4 level43)
(sum level39 level17 level56)
(sum level39 level25 level64)
(sum level40 level4 level44)
(sum level40 level17 level57)
(sum level40 level25 level65)
(sum level41 level4 level45)
(sum level41 level17 level58)
(sum level41 level25 level66)
(sum level42 level4 level46)
(sum level42 level17 level59)
(sum level42 level25 level67)
(sum level43 level4 level47)
(sum level43 level17 level60)
(sum level43 level25 level68)
(sum level44 level4 level48)
(sum level44 level17 level61)
(sum level44 level25 level69)
(sum level45 level4 level49)
(sum level45 level17 level62)
(sum level45 level25 level70)
(sum level46 level4 level50)
(sum level46 level17 level63)
(sum level46 level25 level71)
(sum level47 level4 level51)
(sum level47 level17 level64)
(sum level47 level25 level72)
(sum level48 level4 level52)
(sum level48 level17 level65)
(sum level48 level25 level73)
(sum level49 level4 level53)
(sum level49 level17 level66)
(sum level49 level25 level74)
(sum level50 level4 level54)
(sum level50 level17 level67)
(sum level50 level25 level75)
(sum level51 level4 level55)
(sum level51 level17 level68)
(sum level51 level25 level76)
(sum level52 level4 level56)
(sum level52 level17 level69)
(sum level52 level25 level77)
(sum level53 level4 level57)
(sum level53 level17 level70)
(sum level53 level25 level78)
(sum level54 level4 level58)
(sum level54 level17 level71)
(sum level54 level25 level79)
(sum level55 level4 level59)
(sum level55 level17 level72)
(sum level55 level25 level80)
(sum level56 level4 level60)
(sum level56 level17 level73)
(sum level56 level25 level81)
(sum level57 level4 level61)
(sum level57 level17 level74)
(sum level57 level25 level82)
(sum level58 level4 level62)
(sum level58 level17 level75)
(sum level58 level25 level83)
(sum level59 level4 level63)
(sum level59 level17 level76)
(sum level59 level25 level84)
(sum level60 level4 level64)
(sum level60 level17 level77)
(sum level61 level4 level65)
(sum level61 level17 level78)
(sum level62 level4 level66)
(sum level62 level17 level79)
(sum level63 level4 level67)
(sum level63 level17 level80)
(sum level64 level4 level68)
(sum level64 level17 level81)
(sum level65 level4 level69)
(sum level65 level17 level82)
(sum level66 level4 level70)
(sum level66 level17 level83)
(sum level67 level4 level71)
(sum level67 level17 level84)
(sum level68 level4 level72)
(sum level69 level4 level73)
(sum level70 level4 level74)
(sum level71 level4 level75)
(sum level72 level4 level76)
(sum level73 level4 level77)
(sum level74 level4 level78)
(sum level75 level4 level79)
(sum level76 level4 level80)
(sum level77 level4 level81)
(sum level78 level4 level82)
(sum level79 level4 level83)
(sum level80 level4 level84)

(connected l0 l1)
(fuelcost level25 l0 l1)
(connected l0 l2)
(fuelcost level4 l0 l2)
(connected l1 l0)
(fuelcost level25 l1 l0)
(connected l1 l2)
(fuelcost level17 l1 l2)
(connected l2 l0)
(fuelcost level4 l2 l0)
(connected l2 l1)
(fuelcost level17 l2 l1)

(at t0 l0)
(fuel t0 level84)
(= (total-cost) 0)

(at p0 l0)
(at p1 l2)
(at p2 l2)
(at p3 l1)
(at p4 l0)
(at p5 l1)
(at p6 l2)
(at p7 l0)
)

(:goal
(and
(at p0 l1)
(at p1 l1)
(at p2 l0)
(at p3 l2)
(at p4 l1)
(at p5 l0)
(at p6 l1)
(at p7 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p7 t0 l0)
   deleted: (at p7 l0)
   added: (in p7 t0)
   goals met: 0 of 8
2. (load p4 t0 l0)
   deleted: (at p4 l0)
   added: (in p4 t0)
   goals met: 0 of 8
3. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 0 of 8
4. (drive t0 l0 l1 level59 level25 level84)
   deleted: (at t0 l0) (fuel t0 level84)
   added: (at t0 l1) (fuel t0 level59)
   goals met: 0 of 8
5. (load p5 t0 l1)
   deleted: (at p5 l1)
   added: (in p5 t0)
   goals met: 0 of 8
6. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 0 of 8
7. (drive t0 l1 l2 level42 level17 level59)
   deleted: (at t0 l1) (fuel t0 level59)
   added: (at t0 l2) (fuel t0 level42)
   goals met: 0 of 8
8. (unload p7 t0 l2)
   deleted: (in p7 t0)
   added: (at p7 l2)
   goals met: 1 of 8
9. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 2 of 8
10. (load p6 t0 l2)
   deleted: (at p6 l2)
   added: (in p6 t0)
   goals met: 2 of 8
11. (load p2 t0 l2)
   deleted: (at p2 l2)
   added: (in p2 t0)
   goals met: 2 of 8
12. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 2 of 8
13. (drive t0 l2 l0 level38 level4 level42)
   deleted: (at t0 l2) (fuel t0 level42)
   added: (at t0 l0) (fuel t0 level38)
   goals met: 2 of 8
14. (unload p2 t0 l0)
   deleted: (in p2 t0)
   added: (at p2 l0)
   goals met: 3 of 8
15. (unload p5 t0 l0)
   deleted: (in p5 t0)
   added: (at p5 l0)
   goals met: 4 of 8
16. (drive t0 l0 l1 level13 level25 level38)
   deleted: (at t0 l0) (fuel t0 level38)
   added: (at t0 l1) (fuel t0 level13)
   goals met: 4 of 8
17. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 5 of 8
18. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 6 of 8
19. (unload p4 t0 l1)
   deleted: (in p4 t0)
   added: (at p4 l1)
   goals met: 7 of 8
20. (unload p6 t0 l1)
   deleted: (in p6 t0)
   added: (at p6 l1)
   goals met: 8 of 8
